fe40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1e-06;

vertices
(
  (0 0 0)
  (60 0 0)
  (60 10 0)
  (0 10 0)
  
  (0 0 10)
  (60 0 10)
  (60 10 10)
  (0 10 10)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (1 90 1) simpleGrading (1 41.67 1)     
);

edges
(
);

boundary
(
     cyc01
     {
      type cyclic;
      faces
      (
            (0 3 7 4)  
            (1 2 6 5)              
      );
    }
    
    reservoir
    {
        type wall;
        faces
        (
            (3 2 6 7)      
        );
    }
    
    membrane
    {
        type wall;
        faces
        (
            (0 1 5 4)              
        );
    }
    
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)  
            (4 5 6 7)    
        );
    }
        
);

mergePatchPairs
(
);

// ************************************************************************* //
