fe40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    cyc01
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            fixedValue;
	value           uniform (0 0 0);       
    }
    
    membrane
    {
	type            fixedValue;
	value           uniform (0 0 0);      
    }
    
    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
