fe40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    cyc01
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            zeroGradient; 
    }
    
    membrane
    {
	type            zeroGradient;  
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
