fe40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/0/cAnion
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      ciAnion;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 -3 0 0 1 0 0 ];

internalField   uniform 1;

boundaryField
{
    cyc01
    {
	type            cyclic;
    }
   
    reservoir
    {
	type            fixedValue;
	value           uniform 1;       
    }
    
    membrane
    {
	type            zeroIonicFlux;
	value           uniform 1;       
    }

    frontAndBack
    {
	type            empty;     
    }
}

// ************************************************************************* //
