fe40/tutorials/rheoEFoam/selecMembrane/NernstPlanck/solution1D/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application directory
application=`getApplication`

runApplication blockMesh

echo "Running $application in solution1D and ouputing to null."
$application>/dev/null
